package com.JavaSyntaxPro.level_4.lecture_11;

public class Task_1 {
    /*
    1. В каком примере цикл выведет на экран числа от 1 до 10:
    int i = 0;
    while(i <= 10) {
        System.out.println(i);
        i++;
    }

    2. В каком примере цикл выведет на экран числа от 10 до 1:
    int i = 10;
    while(i > 0) {
        System.out.println(i);
        i--;
    }

    3. Досрочно выйти из цикла можно с помощью оператора:
    -break;

    4. Досрочно завершить текущий виток цикла можно с помощью оператора:
    -continue;

    5. В каком примере цикл выведет на экран числа от 1 до 10:
       for (int i = 1; i <= 10; i++) {
            System.out.println(i);
       }

    6. В каком примере цикл выведет на экран числа от 10 до 5:
       for (int i = 10; i >= 5; i--) {
          System.out.println(i);
       }

     7. Выберите наиболее верное утверждение для данного кода:
        for(int i = 0; i < 10; i++) {
            System.out.println(i);
            continue;
        }
     -Код выведет на экран числа от 0 до 9

     8. Выберите наиболее верное утверждение для данного кода:
        for(int i = 0; i < 10; i++) {
            continue;
            System.out.println(i);
        }
     -Код не скомпилируется

     9. Значение переменной х в примере ниже будет равно:
        int x = (int) Math.round(4.9);
     -5;

     10. Значение переменной х в примере ниже будет равно:
         int x = (int) Math.ceil(4.9);
     -5;
     */
}
