package com.JavaSyntaxPro.level_8.lecture_8;

public class Task_1 {
    /*
    1. Какой из вариантов содержит примитивные типы языка Java?
    -int, double, float;

    2. Какое значение у выражения 0.0 / 0.0?
    -NaN;

    3. Какое значение у выражения 0 / 0?
    -Будет ошибка ArithmeticException("Division by zero!");

    4. Правильно скомпилируется вариант
    -int x = (int) 3.14;

    5. Какой из примитивных типов данных есть в языке Java?
    -char;

    6. В классе объявили переменную String s, но еще не присвоили ей значение. Она содержит?
    -null;

    7. Новый объект в Java создается с помощью ключевого слова
    -new;

    8. Какой из этих принципов есть в ООП?
    -Наследование;

    9. В каком из вариантов правильно описано наследование класса Собака и класса Волк?
    -class Собака extends Волк;

    10. Если класс не унаследован ни от кого, то он
    -Неявно наследован от класса Object;
     */
}
