package com.JavaSyntaxPro.level_3.lecture_11;

public class Task_1 {
    /*
    1. Выберите вариант ответа в котором корректно записан условный оператор:
    -if(a < b) return a;
    else return b;

    2. В условном операторе может отсутствовать:
    -else и команда2 (команда, которая выполняется когда условие ложно);\

    3. В языке Java переменные типа boolean могут принимать значения
    -true, false

    4. Корректное логическое выражение (для языка Java) записано в виде...
    -(a < 3) && (b < 3);

    5. Корректное логическое выражение (для языка Java) записано в виде...
    -x > 10 && x < 20;

    6. В языке Java для отрицания(инверсии) логического выражения используется оператор:
    -!;

    7. Максимум из двух чисел вычисляется в выражении?
    -a > b ? a : b;

    8. Вещественные переменные a и b типа double наиболее корректно сравниваются в выражении:
    -Math.abs(a - b) < 0.0001;

    9. Строковые переменные a и b правильно сравниваются в выражении:
    -a.equals(b);

    10. Строковые переменные a и b правильно сравниваются без учета регистра символов в выражении:
    -a.equalsIgnoreCase(b);
     */
}
