package com.JavaSyntaxPro.level_9.lecture_8;

public class Task_1 {
    /*
    1. Вычислить квадратный корень из числа х можно с помощью выражения?
    -Math.sqrt(x);

    2. Вычислить синус угла x можно с помощью выражения
    -Math.sin(x);

    3. Выражение int (Math.random()*6) будет принимать значения в диапазоне
    -0,1,2,3,4,5;

    4. Приостановить программу на полсекунды можно с помощью команды:
    -Thread.sleep(500);

    5. Какая команда скомпилируется?
    -int x = (3 & 4);

    6. «Побитовое «И» двух целых чисел задается оператором?
    -" & "

    7. «Побитовое «ИЛИ» двух целых чисел задается оператором?
    -" | "

    8. «Побитовое «НЕ» для целого числа задается оператором?
    -" ~ "

    9. Чему будет равно выражение 1 << 4 ?
    -16;

    10. Чему будет равно выражение 16 >> 2 ?
    -4;
     */
}
