package com.JavaSyntaxPro.level_12.lecture_7;

public class Task_1 {
    /*
    1. Минимальная программа в Java содержит
    -1 класс и 1 метод;

    2. Класс в Java может содержать (выберите наиболее полный вариант ответа)
    -переменные, методы, конструкторы

    3. К статической переменной можно обращаться из нестатического метода?
    -да

    4. К нестатической переменной можно обращаться из статического метода?
    -нет

    5. К статическому методу можно обращаться из нестатического метода?
    -да

    6. К нестатическому методу можно обращаться из статического метода?
    -нет

    7. Если нестатическую переменную пометить ключевым словом static, то она станет общей переменной для всех объектов этого класса?
    -да

    8. Если статическую переменную превратить в нестатическую, то ее копия появится у каждого объекта этого класса?
    -да

    9. Статические методы могут иметь доступ в том же классе:
    -к статическим переменным и статическим методам

    10. Может ли вложенный класс, помеченный как static содержать нестатические методы?
    -да
     */
}
