package com.JavaSyntaxPro.level_15.lecture_7;

public class Task_1 {
    /*
    1. Оператор try-catch используется для того чтобы
    -Перехватить исключения

    2. Если исключение так и не было перехвачено то (выберите наиболее полное утверждение)
    -Программа досрочно завершится

    3. Оператор try-catch-finally может быть записан без блоков:
    -catch, finally

    4. Сколько блоков catch может быть у одного try?
    -сколько угодно

    5. Сколько блоков finally может быть у одного try?
    -0 или 1

    6. Исключения RuntimeException и исключения Exception относятся друг к другу?
    -Исключения RuntimeException являются подмножеством Exception

    7. Выбросить свое исключение можно с помощью оператора
    -throw

    8. Checked-исключение обязательно нужно-
    -перехватить в блоке catch или указать после ключевого слова throws

    9. Если в программе (в блоке catch) перехвачено исключение, как вывести стек вызовов методов в консоль?
    -e.printStackTrace();

    10. СтэкТрейс – это массив, содержащий информацию о:
    -о вызванных методах, которые еще не завершились
     */
}
