package com.JavaSyntaxPro.level_7.lecture_1;

/*
Перед тобой — плохой пример использования методов:

Методы разделили двустишие;
Одну строку кода не стоит оборачивать в отдельный метод.
Перепиши код так, чтобы весь текст выводился в методе main, а остальные методы удали.
Вывод программы не должен измениться.
Требования:
•	Метод main() должен быть единственным методом в классе Solution.
•	Вывод в консоли должен соответствовать условию задачи.
 */
public class Task_2 {
    public static void main(String[] args) {
        System.out.println("Я — поэт, зовусь я Цветик.");
        System.out.println("От меня вам всем приветик.");
    }
}
