package com.JavaSyntaxPro.level_10.lecture_1;
/*
В классе Solution объявлены и проинициализированы семь публичных полей.
Они инициализируются разными значениями — литералами с плавающей точкой. Но программа не компилируется, и нужно это исправить. Для этого измени типы полей,
чтобы они соответствовали значениям. Имена и значения полей не изменяй.

Требования:
•	Изменить тип поля a, чтобы программа компилировалась.
•	Изменить тип поля b, чтобы программа компилировалась.
•	Изменить тип поля c, чтобы программа компилировалась.
•	Изменить тип поля d, чтобы программа компилировалась.
•	Изменить тип поля e, чтобы программа компилировалась.
•	Изменить тип поля f, чтобы программа компилировалась.
•	Изменить тип поля g, чтобы программа компилировалась.
 */
public class Task_2 {
    public double a = 0.;
    public double b = .0;
    public double c = 100D;
    public double d = 100.0;
    public double e = 1.11E5;
    public float f = 200F;
    public float g = 0.F;
}
