package com.JavaSyntaxPro.level_11.lecture_7;

public class Task_1 {
    /*
    1. «Класс» относится к «объекту» как
    -"Рецепт печенья" к "Печенью"

    2. В Java объекты создаются выражением...
    -new Object();

    3. Специальный метод класса, который вызывается при создании объекта, называется?
    -конструктор

    4. Конструктор класса Solution правильно объявлен в варианте:
    -public Solution(){}

    5. Если в классе не объявлено ни одного конструктора, то
    -Компилятор сам добавит конструктор и он будет public

    6. У вас объявлена переменная класса String name, как будет выглядеть сеттер для этой переменной?
    -public void setName(String newName)

    7. У вас объявлена переменная класса String name, как будет выглядеть геттер для этой переменной?
    -public String getName()

    8. В классе Solution объявлены геттер и сеттер в виде public String getName()
    и public void setName(String name). Как должна быть объявлена переменная класса с которой они работают?
    -private String name;

    9. Если вы хотите сравнить содержимое двух объектов, то воспользуйтесь для этого методом?
    -equals();

    10. Для быстрого (и неточного) сравнения объектов есть специальный метод, он называется?
    -hashCode();
     */
}
