package com.JavaSyntaxPro.level_17.lecture_9;

public class Solution {
    /*
    1. IDEA отображает вам имя метода перечеркнутым горизонтальной чертой. Что это значит?
    - Метод не рекомендуют использовать

    2. Как получить текущее время с помощью класса Date?
    - просто создать новый объект класса Date

    3. Метод getMonth(); у объекта Date(); вернул значение 2, о каком месяце идет речь?
    - Март

    4. По Григорианскому календарю сейчас 2020 год, а сколько всего календарей сейчас в мире официально?
    - 7+

    5. Метод calendar.get(Calendar.MONTH) у объекта Calendar вернул значение 2, о каком месяце идет речь?
    - Март

    6. Как получить текущую дату с помощью класса LocalDate?
    - Вызвать метод  LocalDate.now();

    7. Как получить текущую дату в Шанхае с помощью класса LocalDate?
    - LocalDate.now(ZoneId.of("Asia/Shanghai"));

    8. Метод getMonthValue() у объекта LocalDate вернул значение 2, о каком месяце идет речь?
    - Февраль

    9. Как получить текущее время с помощью класса localTime?
    - Вызвать метод  LocalTime.now();

    10. Для отображения даты 4 июля 2020 года используется объект созданный командой DateTimeFormatter.ofPattern("MM-dd-yy"); Какую дату он отобразит?
    - 07-04-20
     */
}
