package com.JavaSyntaxPro.level_1.lecture_8;

public class Task_1 {
    /*
    1. В языке Java выполнение программы начинается с метода:
    -main();

    2. В языке Java вывести текст на экран можно с помощью функции...
    -print();

    3. В языке Java вывести текст на экран в несколько строк можно с помощью функции...
    -println();

    4. В языке Java у каждой переменной есть:
    -имя, тип, значение;

    5. В языке Java объявить переменную name можно с помощью команды:
    -String name;

    6. В языке Java целые числа хранятся в переменных с типом:
    -int;

    7. В языке Java многострочный комментарий начинается/создается с помощью символов...
    -/*;

    8. В языке Java самые часто употребляемые типы данных...
    -int & String;

    9. Java-компилятор после компиляции выдает...
    -программу состоящую из байт-кодов;

    10. JVM – это:
    -Java Virtual Machine;

     */
}
