package com.JavaSyntaxPro.level_20.lecture_7;

public class Solution {
    /*
    1. Выберите неверное утверждение
    - задачи-игры могут писать только пользователи чей уровень не меньше 20

    2. Какое действие не обязательно при создании своей задачи-игры?
    - включить сетку-showGrid()

    3. С помощью какого метода можно установить цвет клетки на игровом поле?
    - setCellColor()

    4. С помощью какого метода можно установить цвет текста в клетке на игровом поле?
    - setCellTextColor()

    5. С помощью какого метода можно записать определенный текст в клетку на игровом поле?
    - setCellValue()

    6. В каком методе нужно написать код для обработки события «клик левой кнопки мышки»?
    - void onMouseLeftClick(int x, int y)

    7. В каком методе нужно написать код для обработки события «клик правой кнопки мышки»?
    - void onMouseRightClick(int x, int y)

    8. В каком методе нужно написать код для обработки события «кнопка клавиатуры нажата»?
    - void onKeyPress(Key key)

    9. В каком методе нужно написать код для обработки события «кнопка клавиатуры отпущена»?
    - void onKeyReleased(Key key)

    10. Какое действие лишнее, если мы хотим использовать таймер в нашей игре?
    - использовать переменную-параметр step в методе onTurn(int step)
     */
}
