package com.JavaSyntaxPro.level_5.lecture_9;

public class Task_1 {
    /*
    1. Какое сокращение не имеет отношения к языку Java?
    -GPU

    2. К какой IDE есть плагин от JavaRush?
    -Intellij IDE

    3. Что нельзя сделать с помощью плагина JavaRush для IDEA?
    -Купить новую подписку

    4. Чтобы быстро написать в IDEA код public static void main(String[] args) нужно?
    -Написать psvm и нажать кнопку TAB

    5. Чтобы быстро написать в IDEA код System.out.println() нужно?
    -Написать sout и нажать кнопку TAB

    6. Какое действие лишнее, если вы решили отдебажить вашу программу
    -Запустить программу в режиме выполнения - Shift+F10

    7. С помощью нажатия какой кнопки во время дебага программы можно выполнить код без перехода в вызываемые функции
    -F8

    8. С помощью нажатия какой кнопки во время дебага программы можно выполнить код с переходом в вызываемые функции
    -F7

    9. Что нельзя делать в окне Watch во время отладки программы?
    -Вывести значения переменных в файл

    10. Для того, что бы выполнить произвольный код во время работы программы, которые взаимодействует с ее данными, нужно:
    -Вызвать панель Evaluate Expression с помощью комбинации клавиш Alt-F8
     */
}
