package com.JavaSyntaxPro.level_13.lecture_8;

public class Task_1 {
    /*
    1. У примитивного типа int есть его непримитивный аналог, он называется?
    -Integer

    2. У примитивного типа char есть его непримитивный аналог, он называется?
    -Character

    3. Если в Java написать выражение Integer x = 5; то
    -Компилятор заменит его на Integer x = Integer.valueOf(5);

    4. Какого метода нет у класса Integer?
    -Вывести число на экран

    5. Какого поля нет у класса Double?
    -ABSOLUTE_INFINITY

    6. Какие действия нельзя сделать с объектом типа ArrayList?
    -Запретить изменение элементов списка

    7. Какой метод нужно использовать, чтобы вставить элемент в середину списка ArrayList?
    -add(int index, тип value);

    8. Какой метод нужно использовать чтобы удалить элемент из середины списка ArrayList?
    -remove(тип value);

    9. Какой метод нужно использовать чтобы узнать количество элементов списка ArrayList?
    -Метод size();

    10. Какой командой можно проверить, что переменная х содержит ссылку на объект типа Cat?
    -x instanceof Cat
     */
}
