package com.JavaSyntaxPro.level_10.lecture_8;

public class Task_1 {
    /*
    1. Каждый символ в строке занимает:
    -2 или 4 байта

    2. Каким способом в Java нельзя задать символ - значение типа char?
    -char a = '';

    3. Выберите число заданное в восьмеричной кодировке
    -010

    4. Выберите число заданное в двоичной кодировке
    -0b10

    5. Выберите число заданное в шестнадцатеричной кодировке
    -0х10

    6. С помощью какой escape-последовательности можно закодировать символ enter (перенос строки)?
    -\n

    7. С помощью какой escape-последовательности можно закодировать символ \ (косая черта)?
    -\\

    8. С помощью какой escape-последовательности можно закодировать символ " (двойная кавычка)?
    -\"

    9. В Java строки хранят все символы в кодировке
    -UTF-16

    10. Получить подстроку из строки s можно с помощью выражения
    -s.substring(2, 10);
     */
}
