package com.JavaSyntaxPro.level_7.lecture_7;

public class Test_1 {
    /*
    1. Функция/метод правильно объявлена в примере...
    -int doWork();

    2. Метод можно объявлять:
    -в классе

    3. Если метод не планирует возвращать результат, то его тип при объявлении метода:
    -void

    4. В каком варианте объявления метода правильно указаны параметры?
    -print(int a, int b);

    5. Функция/метод вычисляет минимум из двух целых чисел, ее объявление имеет вид
    - int min(int a, int b);

    6. Функция/метод возвращает результат с помощью команды вида...
    -return x;

    7. Какой модификатор доступа не существует в Java?
    -internal

    8. Выберите правильный вариант метода main(), с которого начинает выполняться программа на Java:
    -public static void main(String[] args)

    9. Сделать переменную неизменяемой можно с помощью ключевого слова
    -final

    10. Одно из имен переменных некорректно, какое именно?
    -int 1a;
     */
}
