package com.JavaSyntaxPro.level_2.lecture_9;

public class Task_1 {
    /*
    1. В переменных типа int в языке Java можно хранить
    -Целые числа;

    2. Максимальное значение, которое можно хранить в переменной типа int в языке Java:
    -2.147.483.647;

    3. Переменная типа int занимает в памяти N байт:
    -4 байта

    4. В языке Java значение выражения 5/2 будет:
    -2

    5. В языке Java значение выражения 5%2 будет:
    -1;

    6. В языке Java преобразовать строку (содержащую цифры) в число можно командой:
    -Integer.parseInt("123");

    7. В языке Java получить длину строки "hello" можно командой:
    -"hello".length;

    8. В Java для чтения данных с консоли (с клавиатуры) используется стандартный класс:
    -Scanner;

    9. В Java ввести число с клавиатуры (с помощью объекта Scanner) можно командой вида:
    -scanner.nextInt();

    10. В Java ввести строку с клавиатуры и из объекта Scanner можно с помощью команды вида:
    -scanner.nextLine();


     */
}
