package com.JavaSyntaxPro.level_6.lecture_9;

public class Task_1 {
    /*
    1. Массив на 100 целых чисел можно создать с помощью команды вида:
    -int[] array = new int[100];

    2. В массиве 100 элементов, каковы их индексы?
    -0,1,2,3...99;

    3. В массиве A ровно 100 элементов, значение каждого элемента равно его индексу. Команда System.out.println(A[100]) выведет на экран
    -ОШИБКУ ArrayIndexOfBoundException

    4. Какой командой можно определить количество элементов в массиве a?
    -a.length;

    5. Квадратный массив можно создать с помощью команды вида?
    -int[][] array = new int[100][100];

    6. Количество строк в двумерном массиве array можно определить командой:
    -array.length;

    7. Количество столбцов в двумерном массиве array можно определить командой:
    -array[0].length;

    8. Заполнить массив a числом 100 можно командой
    -Arrays.fill(a, 100);

    9. Отсортировать значения массива a можно командой
    -Arrays.sort(a);

    10. Сравнить содержимое двух квадратных массивов можно с помощью выражения
    -Arrays.deepEquals(array1, array2);
     */
}
