package com.JavaSyntaxPro.level_19.lecture_8;

public class Solution {
    /*
    1. Лямбда-выражение преобразовывается компилятором в
    - в анонимны внутренний класс

    2. Выберите лишний пример:
    - list.forEach(System.out.println)

    3. Какой пример соответствует коду объект::метод?
    - x -> объект.метод(х)

    4. Как преобразовать коллекцию ArrayList<String> list в поток данных?
    - Stream<String> stream = list.stream()

    5. Как преобразовать массив String[] array в поток данных?
    - Stream<String> stream = Arrays.stream(array)

    6. С помощью какого метода класса Stream можно получить первые 100 объектов из потока данных?
    - limit(int n)

    7. С помощью какого метода класса Stream можно пропустить/проигнорировать первые 100 объектов из потока данных?
    - skip(int n)

    8. С помощью какого метода класса Stream можно проверить, что в потоке данных есть объект, соответствующий определенному правилу?
    - anyMatch()

    9. С помощью какого метода класса Stream можно выкинуть/проигнорировать из потока данные не соответствующие определенному правилу?
    - filter()

    10. С помощью какого метода класса Collectors можно преобразовать все объекты потока данных в одну строку?
    - joining()
     */
}
