package com.JavaSyntaxPro.level_8.lecture_1;

/*
Создай по одной переменной каждого примитивного целочисленного типа в классе Solution.
Этим переменным присвой минимально возможное для них значение.
Никаких методов создавать не нужно.

Требования:
•	В классе Solution должны быть созданы переменные всех примитивных целочисленных типов.
•	Всем целочисленным переменным должно быть присвоено минимально возможное для них значение.
•	В классе Solution не должно быть создано никаких методов.
 */
public class Task_3 {
    byte aByte = Byte.MIN_VALUE;
    short aShort = Short.MIN_VALUE;
    int anInt = Integer.MIN_VALUE;
    long aLong = Long.MIN_VALUE;
}
