package com.JavaSyntaxPro.level_8.lecture_1;

import java.text.DecimalFormat;

/*
Перед тобой 5 общеизвестных величин.
Перепиши их в более читаемый формат — экспоненциальный. Мантиcса должна представлять собой дробное число от 1.0 до 10.
После изменения формата чисел реальное значение, хранимое в переменной, не должно измениться.

Пример:
109.1678 — обычная форма;
1.091678E+2 — экспонентная форма записи.

Требования:
•	Существующим переменным должны присваиваться значения, записанные в экспонентном виде.
•	Значением мантисы должно быть дробное число от 1.0 до 10.
•	Реальное значение переменных не должно измениться.
 */
public class Task_4 {
    double earthDiameter = 1.27420E+4;
    double lightSpeed = 2.997924580E+8;
    double uraniumAtomicMass = 2.380289E+2;
    double averageBeeWeight = 8.5E-2;
    double javaDeveloperSalary = 1.0E+4;
}