package com.JavaSyntaxPro.level_14.lecture_8;

public class Task_1 {
    /*
    1. Какой метод нужно использовать чтобы из множества HashSet получить элемент с определенным номером?
    -нет такого метода;

    2. Какой метод нужно использовать чтобы из множества HashSet удалить элемент с определенным номером?
    -нет такого метода;

    3. В каком примере правильно выводятся на экран все элементы объекта HashSet?
    -HashSet<String> set = new HashSet<String>();
    for(String item : set){
        System.out.println(item);
    }

    4. Какой метод нужно использовать чтобы из объекта HashMap получить элемент с определенным номером?
    -нет такого метода;

    5. Какой метод нужно использовать чтобы из объекта HashMap удалить элемент с определенным номером?
    -нет такого метода;

    6. В каком примере правильно выводятся на экран все значения (values) объекта HashMap?
    -HashMap<String, String> map = new HashMap<String, String>();
        for (String key : map.keySet()){
            System.out.println(map.get(key));
        }

     7. Какой метод класса Collections нужно использовать, чтобы заполнить определенную коллекцию заданным значением?
     -Collections.fill(list, obj);

     8. Какой метод класса Collections нужно использовать, чтобы отсортировать определенную коллекцию?
     -Collections.sort(list);

     9. У вас есть enum Day содержащий значения MONDAY, …, SUNDAY. Как получить порядковый номер константы FRIDAY?
     -Day.FRIDAY.ordinal;

     10. У вас есть enum Day содержащий значения MONDAY, …, SUNDAY. Как получить I-е по порядку значение этого типа?
     -Day.values()[i];

     11. Для задания значения по умолчанию в операторе switch используется ключевое слово:
     -default;

     12. Оператор foreach в Java правильно записан в виде:
     -for(var item : list);
     */
}
