package com.JavaSyntaxPro.level_18.lecture_9;

public class Solution {
    /*
    1. Что не может дать инкапсуляция
    -Устранение ошибок компиляции

    2. Можно ли в переменную базового класса присвоить ссылку на объект класса-наследника?
    -Да

    3. Можно ли в переменную класса-наследника присвоить ссылку на объект базового класса?
    -Нет

    4. Переменная super используется для?
    -Вызов метода базового класса, который переопределен в текущем классе

    5. Перегрузка методов – несколько методов с одинаковыми именами в одном классе возможна, если
    -У этих методов различные типы параметров

    6. Что нельзя делать с абстрактным классом? (выберите неверное утверждение)
    -Создавать объект абстрактного класса пользуясь оператором new

    7. Что нельзя делать с интерфейсом? (выберите неверное утверждение)
    -Создавать объект интерфейса класса пользуясь оператором new

    8. Какого типа наследования в Java нет? (выберите неверное утверждение)
    -Класс можно наследовать только от одного интерфейса

    9. Может ли абстрактный класс содержать методы с реализацией?
    -Да

    10. Может ли интерфейс содержать методы с реализацией?
    -Да, и такие методы нужно помечать ключевым словом default
     */
}
